app/controllers/documents_controller.rb

	def open
		document = Document.find(params[:id])
---
SELECT  "documents".* FROM "documents" WHERE "documents"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]